In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [2]:
string_data = pd.Series(['aardwark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardwark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [4]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))

In [12]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.503099       NaN       NaN
1 -1.494079       NaN       NaN
2  0.037250       NaN  0.686057
3  1.532343       NaN  2.073953
4 -0.343393 -0.502507 -1.284316
5 -1.205686  1.582553 -0.079385
6  1.326784  0.326546  0.226982

In [13]:
df.dropna(thresh=3)

          0         1         2
4 -0.343393 -0.502507 -1.284316
5 -1.205686  1.582553 -0.079385
6  1.326784  0.326546  0.226982

In [14]:
df.fillna(0)

          0         1         2
0  0.503099  0.000000  0.000000
1 -1.494079  0.000000  0.000000
2  0.037250  0.000000  0.686057
3  1.532343  0.000000  2.073953
4 -0.343393 -0.502507 -1.284316
5 -1.205686  1.582553 -0.079385
6  1.326784  0.326546  0.226982

In [16]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0  0.503099  0.500000 -1.000000
1 -1.494079  0.500000 -1.000000
2  0.037250  0.500000  0.686057
3  1.532343  0.500000  2.073953
4 -0.343393 -0.502507 -1.284316
5 -1.205686  1.582553 -0.079385
6  1.326784  0.326546  0.226982

In [17]:
_ = df.fillna(0, inplace=True)

In [18]:
df

          0         1         2
0  0.503099  0.000000  0.000000
1 -1.494079  0.000000  0.000000
2  0.037250  0.000000  0.686057
3  1.532343  0.000000  2.073953
4 -0.343393 -0.502507 -1.284316
5 -1.205686  1.582553 -0.079385
6  1.326784  0.326546  0.226982

In [19]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.059087 -1.641084  0.136644
1  0.069265  0.571266 -0.351270
2 -0.086274       NaN -0.089912
3  0.191070       NaN -0.466067
4 -0.463478       NaN       NaN
5 -0.855620       NaN       NaN

In [20]:
df.fillna(method='ffill')

          0         1         2
0  0.059087 -1.641084  0.136644
1  0.069265  0.571266 -0.351270
2 -0.086274  0.571266 -0.089912
3  0.191070  0.571266 -0.466067
4 -0.463478  0.571266 -0.466067
5 -0.855620  0.571266 -0.466067

In [21]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.059087 -1.641084  0.136644
1  0.069265  0.571266 -0.351270
2 -0.086274  0.571266 -0.089912
3  0.191070  0.571266 -0.466067
4 -0.463478       NaN -0.466067
5 -0.855620       NaN -0.466067

In [23]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64